Revit 2026 API

# ICentralLockedCallback Interface

---

An interface that may be used to control Revit's behavior when it tries to lock central and is blocked because another user already has locked central.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface ICentralLockedCallback
```
```vb
Public Interface ICentralLockedCallback
```
```cpp
public interface class ICentralLockedCallback
```
```fsharp
type ICentralLockedCallback = interface end
```

The ICentralLockedCallback type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ShouldWaitForLockAvailability | Returns whether Revit should wait and try again to acquire the lock on central. |

#### Reference

Autodesk.Revit.DB Namespace